{"response": "I. Introduction:\n\nThis Non-Disclosure Agreement (\"NDA\" or \"Agreement\") is entered into between [Party Name A], a legal entity organized and existing under the laws of [insert state or country], with its principal place of business at [insert address], and [Party Name B], a legal entity organized and existing under the laws of [insert state or country], with its principal place of business at [insert address] (collectively referred to as the \"Parties\" or individually as a \"Party\").\n\nThis NDA outlines the terms and conditions under which the Parties agree to share certain confidential information with each other for the purpose of [insert purpose]. This Agreement will be effective from the date of acceptance by both Parties and will remain in effect until [insert duration] unless otherwise terminated by mutual agreement of the Parties.\n\nThis Agreement shall be governed by and construed in accordance with the laws of the State of New York without giving effect to any choice or conflict of law provision or rule.\n\nThe Parties agree that any dispute arising out of or related to this Agreement, including any question regarding its existence, validity or termination, shall be settled through binding arbitration under the rules of the American Arbitration Association (AAA) in New York, New York.\n\nThe Parties agree to keep all information exchanged between them confidential and not disclose such information to any third party without the express written consent of the disclosing Party, except as required by law. Both Parties acknowledge that any unauthorized disclosure of confidential information may cause irreparable harm to the disclosing Party, and that the disclosing Party shall be entitled to seek injunctive relief and any other available remedies at law or in equity.\n\nBy executing this Agreement, the Parties acknowledge that they have read, understood, and agree to be bound by its terms and conditions. \n\nA. Parties\n\nThis Non-Disclosure Agreement (“Agreement”) is entered into on the Effective Date between Party A and Party B (“Parties”). For the purpose of this Agreement, Party A and Party B may be referred to individually as “Disclosing Party” or “Receiving Party”, or collectively as “Parties”.\n\nAll Parties agree to comply with the terms set forth in this Agreement. This Agreement shall be binding upon and inure to the benefit of the Parties, their respective affiliates, and their respective directors, officers, employees, agents, and advisors.\n\nThe Parties acknowledge and agree that the unauthorized disclosure of any Confidential Information, as defined in Section B of this Agreement, could cause irreparable harm to the Disclosing Party. Therefore, the Parties agree to take all necessary precautions to prevent any unauthorized disclosure of Confidential Information.\n\nThis Agreement shall be governed by and construed in accordance with the laws of the State of New York, without giving effect to any choice of law or conflict of law provisions. The Parties hereby consent to the exclusive jurisdiction and venue of the federal and state courts located in the State of New York for any disputes arising out of or related to this Agreement.\n\nEach Party represents and warrants to the other that it has full power and authority to enter into and perform this Agreement, and that this Agreement does not conflict with any other agreement to which it is a party.\n\nThis Agreement may not be modified, amended, or waived in any respect except in writing and signed by both Parties. Any failure to enforce any provisions of this Agreement shall not be deemed a waiver of any subsequent breach or default.\n\nIn witness whereof, the Parties have executed this Agreement as of the Effective Date. \n\nB. Purpose\n\nThis Non-Disclosure Agreement (NDA) sets forth the terms and conditions under which the Disclosing Party, [Generic Party Name], will disclose to the Receiving Party, [Generic Party Name], certain confidential and proprietary information for the purpose of [insert purpose of disclosure, such as \"discussing a potential business collaboration\" or \"evaluating the feasibility of a joint venture\"]. The Receiving Party agrees to maintain the confidentiality of this information and to use it solely for the purpose of [insert purpose of disclosure]. This NDA is governed by and shall be construed in accordance with the laws of the State of New York. \n\nII. Definitions\n\n1. For the purpose of this Non-Disclosure Agreement (NDA), the term \"Disclosing Party\" shall refer to the party disclosing Confidential Information, and the term \"Receiving Party\" shall refer to the party receiving such information.\n\n2. \"Confidential Information\" shall mean any information disclosed by the Disclosing Party to the Receiving Party, whether orally, in writing, or otherwise, that is identified as confidential or proprietary, or that would reasonably be expected to be treated as confidential or proprietary. This may include, without limitation, technical data, trade secrets, inventions, business plans, financial information, and customer lists.\n\n3. \"Recipient Representatives\" shall mean employees, agents, or independent contractors of the Receiving Party who have a need to know and access Confidential Information in order to perform their duties and responsibilities as they relate to the purpose of this NDA.\n\n4. \"Purpose\" shall mean the purpose for which the Receiving Party is receiving the Confidential Information, as set forth in a specific written agreement between the parties, or as otherwise agreed upon in writing.\n\n5. \"Term\" shall mean the period of time during which the Receiving Party may use and disclose Confidential Information, as set forth in Section III of this NDA.\n\n6. \"Third Party\" shall mean any person or entity other than the Disclosing Party or the Receiving Party.\n\n7. \"Applicable Law\" shall mean the laws and regulations of the State of New York and the United States of America that govern the protection of confidential information, including but not limited to the Uniform Trade Secrets Act and the Defend Trade Secrets Act.\n\n8. \"Intellectual Property\" shall mean all patents, copyrights, trademarks, and trade secrets owned by the Disclosing Party or in which the Disclosing Party has an interest.\n\n9. \"Affiliate\" shall mean any entity that directly or indirectly controls, is controlled by, or is under common control with the Disclosing Party.\n\n10. \"Control\" shall mean the power to direct the management or policies of an entity, whether through ownership of voting securities, by contract, or otherwise.\n\n11. \"Person\" shall mean any natural person, partnership, corporation, limited liability company, association, or other legal entity.\n\n12. \"Writing\" shall mean a written or electronic document or record, including any email or text message that is printed or stored in a permanent form.\n\n13. \"Effective Date\" shall mean the date on which this NDA is signed by both parties.\n\n14. \"Survival Period\" shall mean the period of time after the termination of this NDA during which the obligations of confidentiality and non-use shall continue, as set forth in Section III of this NDA. \n\nA. “Party A”: The party referred to as “Party A” in this agreement shall be the individual or entity disclosing confidential information to the other party, referred to as “Party B”. Party A is required to disclose such information for the purpose of the business arrangement between the two parties. Party A shall ensure that all information disclosed is factual, accurate, and in compliance with all applicable laws and regulations.\n\nThis agreement and any dispute arising from it shall be governed by the laws of the State of New York. Party A agrees to comply with any and all laws and regulations applicable to the provision of confidential information and to the performance of the obligations as set out in this agreement.\n\nParty A shall take all necessary precautions to ensure the protection of its confidential information. This includes but is not limited to taking appropriate measures to control access to such information, safeguarding it from unauthorized reproduction, and protecting it from any accidental or intentional unauthorized disclosure.\n\nParty A understands that any breach of this agreement by either party may result in irreparable harm to the other party. In the event of a breach of this agreement, Party A agrees that Party B shall be entitled to immediate injunctive relief, as well as any other available remedies under law.\n\nParty A hereby acknowledges that it has had sufficient opportunity to review this agreement and obtain legal advice regarding its terms and conditions. By signing below, Party A agrees to be bound by this agreement and all of its terms and conditions. \n\nB. \"Party B\"\n\nParty B is the counterparty to this Non-Disclosure Agreement (NDA) and is governed by the laws of the State of New York. Party B agrees to maintain the confidentiality of any confidential information disclosed by Party A and to not disclose any such information to any third party, except as provided for in this agreement. \n\nParty B also acknowledges that any such confidential information is the sole and exclusive property of Party A and shall be returned immediately upon request or termination of this agreement. \n\nParty B agrees to use the confidential information solely for the purpose of evaluating or engaging in potential business transactions with Party A and to take appropriate measures to safeguard the confidential information against unauthorized use or disclosure.\n\nParty B acknowledges that any breach of this agreement may cause irreparable harm to Party A, and that monetary damages may not be an adequate remedy for such breach. Therefore, Party B agrees that in the event of any breach, Party A shall be entitled to seek injunctive relief, without the need for posting a bond, in addition to any other legal remedies available. \n\nParty B further agrees to comply with any and all applicable laws and regulations regarding the use and disclosure of confidential information.\n\nThis section B shall survive termination of any other provision of this agreement and remain in full force and effect. \n\nC. “Confidential Information”\n\n1. Definition. For the purposes of this Agreement, “Confidential Information” means any information, whether conveyed orally or in writing, that:\n\na. Is not generally known or available to the public;\n\nb. Is proprietary to the Disclosing Party;\n\nc. Has commercial value to the Disclosing Party; and\n\nd. The Disclosing Party has treated as confidential or proprietary.\n\n2. Examples. Confidential Information may include, but is not necessarily limited to, trade secrets, know-how, inventions, software, designs, drawings, specifications, techniques, processes, methods, sales and marketing plans, financial information, customer lists, employee information, and any other information which the Disclosing Party reasonably considers to be confidential or proprietary.\n\n3. Scope of Obligations. The Receiving Party agrees to:\n\na. Hold the Confidential Information in confidence and keep it secure;\n\nb. Use the Confidential Information only for the purposes of the Project;\n\nc. Not disclose the Confidential Information to any third party except with the prior written consent of the Disclosing Party;\n\nd. Limit access to the Confidential Information to those employees or agents of the Receiving Party who have a need to know in order to carry out their duties;\n\ne. Notify the Disclosing Party immediately if it becomes aware of any suspected unauthorized use or disclosure of the Confidential Information;\n\nf. Maintain records documenting compliance with the obligations imposed by this Agreement for a period of three (3) years following the termination of the Agreement.\n\n4. Exclusions. The Receiving Party's obligations shall not apply to any information that:\n\na. Is or becomes publicly available through no fault of the Receiving Party;\n\nb. Was in the Receiving Party's possession prior to receipt from the Disclosing Party;\n\nc. Is rightfully obtained by the Receiving Party from a third party without an obligation of confidence;\n\nd. Is independently developed by the Receiving Party without reference to the Confidential Information provided by the Disclosing Party; or\n\ne. Is required to be disclosed by law or court order, provided that the Receiving Party provides the Disclosing Party with prompt written notice of such required disclosure in order that the Disclosing Party may seek an appropriate protective order.\n\n5. Governing Law. This Agreement shall be governed by and construed in accordance with the laws of the State of New York without giving effect to any choice or conflict of law provision or rule (whether of the State of New York or any other jurisdiction) that would cause the application of the laws of any jurisdiction other than the State of New York.\n\n6. Remedies. The Receiving Party acknowledges that any breach or threatened breach of this Agreement may cause irreparable harm to the Disclosing Party for which there may be no adequate remedy at law. Therefore, in addition to any other remedy that may be available to the Disclosing Party, the Disclosing Party shall be entitled to seek injunctive relief without the necessity of posting bond, as well as such other relief as may be available under applicable law, to enforce the provisions of this Agreement. \n\nIII. Obligations of Party A\n\nParty A agrees to keep confidential all information and materials that are disclosed to it by Party B during the term of this Agreement. This obligation applies not only to information that is explicitly marked as confidential, but also to any information that would be considered confidential by a reasonable person given its nature and the circumstances of its disclosure.\n\nParty A further agrees to use any confidential information or materials received from Party B solely for the purpose of performing its obligations under this Agreement. Party A will not disclose any such information or materials to any third party, whether directly or indirectly, without the prior written consent of Party B.\n\nParty A will take all reasonable measures to protect the confidentiality of the information and materials disclosed to it by Party B. This includes physical, technical, and administrative safeguards designed to prevent unauthorized access, use, or disclosure of such information and materials.\n\nIn the event that Party A is required by law or a court of competent jurisdiction to disclose any confidential information or materials received from Party B, Party A will promptly notify Party B in writing of such requirement and will cooperate with Party B to limit such disclosure to the extent practicable under the circumstances.\n\nParty A's obligations under this section shall survive the termination or expiration of this Agreement and shall continue in perpetuity with respect to any confidential information or materials that are not publicly available or generally known. This section shall be governed by and construed in accordance with the laws of the State of New York. \n\nA. Non-Disclosure:\n\n1. Definition:\nFor the purposes of this Agreement, \"Confidential Information\" shall mean any non-public or proprietary information of the Disclosing Party that is disclosed to the Receiving Party, whether in tangible or intangible form, whether oral or written, and whether communicated before, on, or after the Effective Date, that is marked confidential or proprietary, or that a reasonable person would understand to be confidential or proprietary, having regard to the nature of the information and the circumstances of the disclosure.\n\n2. Non-Disclosure Obligations:\nThe Receiving Party shall not, without the prior written consent of the Disclosing Party, directly or indirectly, use, exploit, disclose, distribute, publish, or make available to any third party any Confidential Information except as necessary for the performance of its obligations under this Agreement, and shall take all reasonable steps to protect the confidentiality of Confidential Information.\n\n3. Exceptions:\nThe obligations under section 2 shall not apply to any Confidential Information that:\n- is or becomes generally available to the public through no fault or breach of the Receiving Party,\n- was in the possession of the Receiving Party prior to disclosure, as evidenced by written records,\n- is or becomes available to the Receiving Party from a source other than the Disclosing Party and is not subject to a confidentiality obligation, or\n- is required to be disclosed by law or governmental order, provided that the Receiving Party provides the Disclosing Party with prompt notice of such requirement and cooperates with the Disclosing Party to obtain a protective order or other confidential treatment.\n\n4. Duty of Care:\nThe Receiving Party shall exercise at least the degree of care to protect the Confidential Information as it uses to protect its own confidential or proprietary information, but in no event less than a reasonable standard of care.\n\n5. Ownership:\nThe Disclosing Party shall retain ownership of all Confidential Information, and nothing in this Agreement shall be construed as granting any license, right, or interest in any Confidential Information, whether expressly or by implication.\n\n6. Term:\nThe obligations of the Receiving Party under this Agreement shall commence on the Effective Date and shall continue for a period of five (5) years from the date of this Agreement, unless otherwise terminated earlier in accordance with the terms of this Agreement.\n\n7. Governing Law:\nThis Agreement and any dispute arising out of or in connection with this Agreement shall be governed by and construed in accordance with the laws of the State of New York, without giving effect to its principles of conflict of laws. \n\nB. Non-Use\n\n1. The Receiving Party acknowledges that Confidential Information disclosed to it by the Disclosing Party under this Agreement is provided solely for the purpose of evaluating or pursuing a business relationship between the parties.\n\n2. The Receiving Party shall not use any Confidential Information for any purpose other than as allowed under this Agreement.\n\n3. The Receiving Party shall not disclose any Confidential Information to any third party, except as provided in this Agreement or with the prior written consent of the Disclosing Party.\n\n4. The Receiving Party shall secure and protect the Confidential Information by using the same degree of care it uses to protect its own confidential information, but not less than a reasonable degree of care.\n\n5. The Receiving Party shall immediately notify the Disclosing Party of any suspected or actual unauthorized use or disclosure of the Confidential Information.\n\n6. The Non-Use obligations under this Agreement shall survive the termination of this Agreement for a period of [Insert duration] years.\n\n7. Nothing in this Agreement shall be construed to prevent the Receiving Party from independently developing or acquiring information that is not derived from the Confidential Information or to prevent the Receiving Party from disclosing information that is required to be disclosed by law, regulation, or court order, provided that the Receiving Party provides the Disclosing Party with prompt notice of such requirement to disclose and cooperates with the Disclosing Party to seek a protective order or other appropriate remedy.\n\n8. This Agreement shall be governed by and interpreted in accordance with the laws of the State of New York, without giving effect to its conflicts of law principles.\n\n9. In any dispute arising out of or in connection with this Agreement, the parties agree to submit to the exclusive jurisdiction of the state and federal courts located in New York, New York. \n\nIV. Obligations of Party B\n\n1. Party B shall maintain in strict confidence all Confidential Information, and shall not disclose such Confidential Information or any part thereof to any third party.\n\n2. Party B shall not use any Confidential Information for any purpose other than the purpose of this Agreement, without the prior written consent of Party A.\n\n3. Party B shall take all reasonable measures to protect the Confidential Information against accidental, unauthorized or other disclosure or use, and shall use all reasonable efforts to prevent the unauthorized copying, reproduction, or dissemination of such Confidential Information.\n\n4. Party B shall immediately notify Party A of any actual or suspected unauthorized use, disclosure, or access to any Confidential Information in its possession or control and shall cooperate fully with Party A in any investigation or action taken by Party A to protect its rights to such Confidential Information.\n\n5. Party B shall return or destroy all Confidential Information in its possession or control, including any copies thereof, upon termination or expiration of this Agreement, or at the prior request of Party A.\n\n6. Party B shall not use any trademark, trade name, service mark, logo or other trade identifier of Party A, or any of its affiliates, without the prior written consent of Party A.\n\n7. Party B shall comply with all applicable laws and regulations governing the use and disclosure of Confidential Information and shall indemnify and hold harmless Party A, its affiliates, officers, directors, agents and employees from any and all claims, damages, and expenses arising from any breach by Party B of this Agreement or any applicable law or regulation.\n\n8. Party B acknowledges that Party A shall be entitled to seek injunctive relief, in addition to any other remedies available at law or in equity, for any breach by Party B of this Agreement.\n\n9. This Agreement shall be binding upon and inure to the benefit of the parties hereto and their respective successors and assigns.\n\n10. This Agreement shall be governed by and construed in accordance with the laws of the State of New York without giving effect to its conflict of law provisions.\n\n11. Any dispute arising out of or in connection with this Agreement shall be finally resolved in accordance with the Commercial Arbitration Rules of the American Arbitration Association, and judgment upon the award rendered by the arbitrator(s) may be entered in any court having jurisdiction thereof. The arbitration shall take place in New York, New York.\n\n12. This Agreement constitutes the entire agreement between the parties with respect to the subject matter hereof and supersedes all prior negotiations, representations, agreements, and understandings, whether oral or written.\n\n13. This Agreement may not be amended or modified except in writing signed by both parties.\n\n14. This Agreement may be executed in any number of counterparts, each of which shall be deemed an original and all of which shall constitute one and the same agreement.\n\nIN WITNESS WHEREOF, the parties have executed this Agreement as of the date first set forth above.\n\nSigned:\n\nParty A\n\n___________________________\n\n[Print Name]\n\n[Title]\n\nParty B\n\n___________________________\n\n[Print Name]\n\n[Title] \n\nA. Non-Disclosure\n\n1. Definition of Confidential Information. The term Confidential Information means any information disclosed by one party (the “Disclosing Party”) to the other party (the “Receiving Party”) that is designated as confidential or that reasonably should be understood to be confidential given the nature of the information and the circumstances surrounding disclosure. Confidential Information may include, without limitation, technology, product plans, inventions, trade secrets, business plans, strategies and financial information. Confidential Information may be in written, oral or electronic form.\n\n2. Obligations of the Receiving Party. The Receiving Party shall hold and maintain the Confidential Information in strictest confidence for the sole and exclusive benefit of the Disclosing Party. The Receiving Party shall carefully restrict access to Confidential Information to employees, contractors and third parties as is reasonably required and shall require those persons to sign nondisclosure restrictions at least as protective as those in this Agreement. The Receiving Party shall not, without the prior written approval of the Disclosing Party, use for the Receiving Party’s benefit, publish, copy, or otherwise disclose to others, or permit the use by others for their benefit or to the detriment of the Disclosing Party, any Confidential Information. The Receiving Party shall return to the Disclosing Party any and all records, notes, and other written, printed, or tangible materials in its possession pertaining to Confidential Information immediately if the Disclosing Party requests it in writing.\n\n3. Time Periods. The nondisclosure provisions of this Agreement shall survive the termination of this Agreement and Receiving Party’s duty to hold Confidential Information in confidence shall remain in effect until the Confidential Information no longer qualifies as a trade secret or until Disclosing Party sends Receiving Party written notice releasing Receiving Party from this Agreement, whichever occurs first.\n\n4. Relationships. Nothing contained in this Agreement shall be deemed to constitute either party a partner, joint venture or employee of the other party for any purpose.\n\n5. Severability. If a court finds any provision of this Agreement invalid or unenforceable, the remainder of this Agreement shall be interpreted so as best to affect the intent of the parties.\n\n6. Integration. This Agreement expresses the complete understanding of the parties with respect to the subject matter and supersedes all prior proposals, agreements, representations, and understandings. This Agreement may not be amended except in writing signed by both parties.\n\n7. Waiver. The failure to exercise any right provided in this Agreement shall not be a waiver of prior or subsequent rights.\n\n8. Notice of Immunity. Employee is provided notice that an individual shall not be held criminally or civilly liable under any federal or state trade secret law for the disclosure of a trade secret that is made (i) in confidence to a federal, state, or local government official, either directly or indirectly, or to an attorney; and (ii) solely for the purpose of reporting or investigating a suspected violation of law; or is made in a complaint or other document filed in a lawsuit or other proceeding, if such filing is made under seal. An individual who files a lawsuit for retaliation by an employer for reporting a suspected violation of law may disclose the trade secret to the attorney of the individual and use the trade secret information in the court proceeding, if the individual (i) files any document containing the trade secret under seal; and (ii) does not disclose the trade secret, except pursuant to court order. \n\nB. Non-Use\n\n1. Recipient acknowledges and agrees that nothing contained in this Agreement shall require the Recipient to use any of the Confidential Information or to manufacture, have manufactured, sell, offer for sale, or otherwise distribute any product or service.\n\n2. The Recipient shall keep the Confidential Information confidential and shall not disclose or release any part of it to any third party, except as provided in this Agreement or with the prior written consent of the Discloser.\n\n3. Notwithstanding anything contained in this Agreement, the Recipient may use or disclose any portion of the Confidential Information that:\n\n(i) is or becomes publicly known through no act or fault of the Recipient;\n\n(ii) is already known by the Recipient at the time of disclosure, provided that the Recipient can prove such knowledge by contemporaneous documents;\n\n(iii) is received from a third party entitled to disclose it, without restriction or obligation of confidence, to the Recipient;\n\n(iv) is approved for release by written authorization of the Discloser; or\n\n(v) is required to be disclosed by law or regulation, provided that the Recipient gives the Discloser prompt notice of such requirement and cooperates with the Discloser in seeking an appropriate protective order.\n\n4. In any event, the Recipient shall take all necessary and reasonable measures to protect the Confidential Information from unauthorized use or disclosure in accordance with the terms of this Agreement and the applicable law.\n\n5. The obligations under this Section shall survive the termination of this Agreement for a period of [insert number of years] years from the date of termination. \n\n6. This Agreement shall be governed by and construed in accordance with the laws of the State of New York, without giving effect to any principles of conflicts of law. \n\nV. Term and Termination\n\n(A) Term: This agreement shall commence on the date of its execution and shall continue in effect for a period of five (5) years from that date (the “Term”).\n\n(B) Termination for Breach: If either party breaches any of the material terms or conditions of this Agreement, the other party may terminate this Agreement by providing the breaching party with thirty (30) days written notice of the breach and termination. If the breaching party fails to cure the breach within such thirty (30) day period, then the non-breaching party may terminate this Agreement immediately upon providing written notice of the termination.\n\n(C) Termination for Insolvency: Either party may terminate this Agreement if the other party becomes insolvent, makes an assignment for the benefit of creditors, or any proceeding is instituted by or against the other party under any bankruptcy, insolvency, or debtor relief law.\n\n(D) Termination for Convenience: Either party may terminate this Agreement for any reason by providing the other party with thirty (30) days written notice of the termination.\n\n(E) Effect of Termination: Upon termination of this Agreement for any reason, all obligations and duties of the parties under this Agreement shall cease, except for those obligations and duties that expressly survive the termination of this Agreement. The obligations and duties that expressly survive the termination of this Agreement are those contained in Sections II, III, IV, and VI.\n\n(F) Governing Law: This Agreement shall be governed by and construed in accordance with the laws of the State of New York, without regard to its conflicts of law provisions.\n\n(G) Jurisdiction and Venue: Any legal action arising from or relating to this Agreement shall be brought in the federal or state courts located in the County of New York, State of New York, and each party hereby consents to the exclusive jurisdiction and venue of such courts.\n\n(H) Assignment: This Agreement shall be binding upon and inure to the benefit of the parties hereto and their respective successors and assigns. Except as provided in this Agreement, neither party may assign this Agreement or any of its rights or obligations hereunder without the prior written consent of the other party.\n\n(I) Entire Agreement: This Agreement constitutes the entire understanding between the parties and supersedes all other agreements, whether oral or written, relating to the subject matter hereof. This Agreement may not be amended or modified except in writing signed by both parties hereto.\n\n(J) Counterparts: This Agreement may be executed in counterparts, each of which shall be deemed an original and all of which together shall constitute one and the same instrument. \n\nA. Term:\n\n1. This non-disclosure agreement (\"Agreement\") shall remain in effect for a period of three (3) years from the date of execution by the \"Disclosing Party\" and the \"Receiving Party\".\n\n2. Notwithstanding the details stated in clause 1, the obligations of the Receiving Party concerning the Confidential Information shall survive termination of this Agreement and shall continue for a period of five (5) years from the date of termination of this Agreement.\n\n3. The Disclosing Party may terminate this Agreement by giving thirty (30) days written notice to the Receiving Party, and the Receiving Party shall immediately return and/or destroy all proprietary material or Confidential Information provided by the Disclosing Party.\n\n4. Any breach of this Agreement by the Receiving Party shall entitle the Disclosing Party to all remedies available under law and equity, in addition to being entitled to an injunction and other equitable relief.\n\n5. This Agreement shall be governed by and construed in accordance with the laws of the State of New York, and any action arising out of or relating to this Agreement shall be brought in courts located in the State of New York.\n\n6. Each Party shall bear their own legal cost and expenses (including attorney's fees) incurred in connection with the preparation, negotiation, execution, and enforcement of this Agreement. \n\nB. Termination\n\n1. This agreement may be terminated by either party at any time upon written notice to the other party.\n\n2. Upon termination of this agreement, all confidential information disclosed pursuant to this agreement shall be returned to the disclosing party or destroyed if requested by the disclosing party.\n\n3. This agreement shall survive termination for a period of five (5) years, and shall continue to be binding on the parties with respect to any confidential information disclosed prior to termination.\n\n4. Any breach of this agreement may result in irreparable harm to the disclosing party, and the disclosing party shall be entitled to seek injunctive relief without the requirement of posting a bond or other security.\n\n5. The parties agree that any dispute arising out of or relating to this agreement shall be governed by the law of New York and shall be subject to the exclusive jurisdiction of the courts located in New York.\n\n6. All provisions of this agreement necessary for their interpretation or enforcement shall survive termination of this agreement. \n\nVI. Miscellaneous \n\nA. This Agreement shall be binding upon and inure to the benefit of the parties hereto and their respective successors and assigns.\n\nB. This Agreement embodies the entire agreement and understanding of the parties hereto and supersedes all prior agreements and understandings, whether written or oral, relating to the subject matter hereof. No amendment, modification, or waiver of any provision of this Agreement shall be effective unless in writing signed by the party to be charged with such amendment, modification, or waiver.\n\nC. This Agreement shall be governed by, and construed and enforced in accordance with, the laws of the State of New York, without giving effect to any choice-of-law or conflict-of-law rules, principles, or provisions thereof.\n\nD. All notices, requests, consents, approvals, and other communications hereunder shall be in writing and shall be deemed given upon receipt when delivered personally or by recognized overnight courier, or two business days following deposit in the mail, first class postage prepaid, to the parties hereto at their respective addresses below:\n\n[Party A Name and Address]\n\n[Party B Name and Address]\n\nAny party may change the address to which notices, requests, consents, approvals, and other communications shall be sent to it by giving notice to the other party in the manner provided in this Section.\n\nE. No failure or delay by any party hereto in exercising any right, power, or privilege hereunder shall operate as a waiver thereof, nor shall any single or partial exercise thereof preclude any other or further exercise thereof or the exercise of any other right, power, or privilege hereunder.\n\nF. If any term or provision of this Agreement shall be held to be invalid, illegal, or unenforceable, the validity, legality, and enforceability of the remaining terms and provisions hereof shall not in any way be affected or impaired thereby.\n\nG. This Agreement may be executed in counterparts, each of which shall be deemed an original, but all of which together shall constitute one and the same instrument. Signatures transmitted via facsimile, PDF or any other electronic means shall be deemed to be originals. \n\nH. The headings in this Agreement are for reference purposes only and shall not affect in any way the meaning or interpretation of this Agreement. \n\nI. This Agreement may not be assigned by either party without the prior written consent of the other party, except that either party may assign this Agreement without consent to its affiliate or to any entity that succeeds to all or substantially all of its assets and business related to the subject matter hereof. \n\nIN WITNESS WHEREOF, the parties have executed this Agreement as of the date first above written. \n\n[Party A Name]                                                [Party B Name]\n\nBy: _______________________                      By: _______________________\n\nName: ____________________                    Name: _____________________ \n\nTitle: ______________________                     Title: ______________________ \n\nDate: _____________________                     Date: _____________________ \n\nA. Choice of Law\n\nThis Non-Disclosure Agreement (NDA) shall be governed by and construed in accordance with the laws of the State of New York without regard to its choice of law rules.\n\nAny dispute arising out of or relating to this NDA shall be resolved exclusively in the courts of the State of New York or the United States District Court for the Southern District of New York.\n\nThe parties irrevocably agree to submit to the jurisdiction of the courts of New York and waive any objection they may have to the laying of venue in any such court.\n\nNotwithstanding the foregoing, any party may seek interim equitable relief from any court of competent jurisdiction pending the final resolution of any dispute pursuant to this Agreement, including without limitation, a temporary restraining order, preliminary injunction, or similar relief.\n\nThe prevailing party in any dispute arising out of or relating to this NDA shall be entitled to its reasonable attorneys' fees and costs, in addition to any other relief awarded. \n\nB. Severability\n\nIn the event that any provision of this Agreement or the application thereof shall, for any reason and to any extent, be held invalid or unenforceable, such invalidity or unenforceability shall not affect the other provisions of this Agreement or the application thereof, which shall be and remain valid and enforceable to the fullest extent permitted by law. Furthermore, any provision of this Agreement held invalid or unenforceable shall be reformed and rewritten to the minimum extent necessary to make it valid and enforceable. \n\nThis Agreement shall be governed by and construed in accordance with the laws of the State of New York without regard to its principles of conflicts of laws. Any legal action or proceeding arising out of or relating to this Agreement shall be brought exclusively in a court of competent jurisdiction in New York County, New York, and each party hereby submits to the exclusive jurisdiction of such court for the purpose of any such legal action or proceeding. Each party hereby waives any objection to such venue being inconvenient. \n\nThis Agreement may not be modified, amended, or cancelled, except in writing signed by an authorized representative of each party. This Agreement constitutes the entire agreement and understanding between the parties with respect to the subject matter herein and supersedes all prior agreements and understandings, whether written or oral, relating to such subject matter. \n\nEach party acknowledges that it has read this Agreement, understands it, and agrees to be bound by its terms and conditions. \n\nC. Waiver\n\nAny failure to enforce any provision of this NDA shall not constitute a waiver thereof, nor shall any waiver of any provision of this NDA be binding unless executed in writing by the party making the waiver. The waiver of any breach or default shall not be deemed a waiver of any subsequent breach or default of the same or similar nature. No waiver shall be effective unless it is in writing and signed by an authorized representative of the waiving party.\n\nThis NDA is governed by the laws of the State of New York, and any dispute arising under this NDA must be brought in a court of competent jurisdiction in the State of New York. The parties hereby submit to the jurisdiction of the courts of the State of New York for any and all purposes related to this NDA.\n\nTo the extent permitted by law, any provision of this NDA that is prohibited or unenforceable in any jurisdiction shall, as to that jurisdiction, be ineffective to the extent of such prohibition or unenforceability without invalidating the remaining provisions hereof, and any such prohibition or unenforceability in any jurisdiction shall not invalidate or render unenforceable such provision in any other jurisdiction.\n\nIn addition, any provision of this NDA that is prohibited or unenforceable in any jurisdiction shall remain in full force and effect in all other jurisdictions in which such provision is not prohibited or unenforceable. \n\nD. Entire Agreement\n\nThis Non-Disclosure Agreement (NDA) constitutes the entire agreement between the Disclosing Party and the Receiving Party, and supersedes all prior negotiations, understandings, and agreements, whether written or oral, relating to the subject matter of this NDA. \n\nNo amendment, alteration, waiver, or modification of this NDA shall be binding unless it is in writing and signed by both the Disclosing Party and the Receiving Party. \n\nThis NDA shall be governed by and construed in accordance with the laws of the State of New York without giving effect to its conflict of law provisions. \n\nAny disputes arising under or in connection with this NDA shall be resolved exclusively through binding arbitration in accordance with the rules of the American Arbitration Association, and judgment upon the award rendered by the arbitrator(s) may be entered in any court having jurisdiction thereof. \n\nThis NDA shall be binding upon and inure to the benefit of the parties hereto and their respective successors and assigns. \n\nThe provisions of this NDA shall survive the termination of any business relationship between the parties and shall remain in full force and effect for a period of [insert duration such as 2 years] from the date of its execution or until the disclosed information enters the public domain. \n\nEach party has executed this NDA as of the date written below, intending to be legally bound. \n\n[Insert signatures of both parties and the date executed] \n\nE. Assignment\n\nNeither party shall have the right to assign this Agreement or any of its rights or obligations hereunder without the prior written consent of the other party, except that either party may assign this Agreement and its rights and obligations hereunder to any affiliate or subsidiary or to any person or entity acquiring all or substantially all of its assets or business. Any attempted assignment in violation of this provision shall be null and void.\n\nThis Agreement shall be binding upon and inure to the benefit of the parties hereto and their respective successors and assigns.\n\nThis Agreement and any rights hereunder may be assigned, pledged or otherwise transferred by the Company to any person or entity without the prior consent of the Executive.\n\nThis Agreement shall be governed by and construed in accordance with the laws of the State of New York, without giving effect to any choice of law or conflict of law provisions. \n\nF. Notices\nAny notice or communication required or permitted under this Agreement shall be in writing and shall be deemed to have been duly given and received (i) when delivered in person, (ii) one day after it has been sent by overnight courier service, or (iii) three days after it has been sent by registered or certified mail, postage prepaid, return receipt requested and addressed, as follows:\n\nIf to Disclosing Party:\n\n[Insert Disclosing Party Name and Address]\n\nIf to Receiving Party:\n\n[Insert Receiving Party Name and Address]\n\nEither Party may change its address for notice purposes by written notice to the other Party. Any notices that the Parties send to each other shall reference this Agreement and shall be sent to the mailing addresses provided above, as such addresses may be updated from time to time. \n\nG. Force Majeure:\n\n1. In the event that either party is unable to perform any of its obligations under this Agreement due to a Force Majeure Event, such party shall be excused from performance for the duration of the Force Majeure Event.\n\n2. The term \"Force Majeure Event\" means any event beyond the control of the party affected that prevents such party from performing its obligations under this Agreement, including without limitation acts of God, war, terrorism, riots, embargoes, acts of civil or military authorities, fire, floods, earthquakes, accidents, strikes, or shortages of transportation, facilities, fuel, energy, labor or materials.\n\n3. The affected party shall use its reasonable efforts to mitigate the effects of the Force Majeure Event and to resume performance of its obligations under this Agreement as soon as practicable.\n\n4. If a Force Majeure Event continues for a period of thirty (30) days, either party may terminate this Agreement upon written notice to the other party.\n\n5. Neither party shall be liable to the other party for any delay or failure to perform any of its obligations under this Agreement due to a Force Majeure Event, but all other terms and conditions of this Agreement shall remain in full force and effect.\n\n6. This Section G shall be governed by the laws of the State of New York. \n\nH. Headings: The headings used in this Nda contract are for convenience only and are not intended to be a part of or to affect the meaning or interpretation of this agreement. All references to sections or subsections contained in this agreement refer to those sections and subsections as designated in this agreement unless otherwise indicated. \n\nThis Nda contract shall be governed by and construed in accordance with the laws of the State of New York, without giving effect to the principles of conflicts of law. Any legal action, suit, or proceeding arising out of or relating to this agreement shall be brought in the courts of record of the State of New York located in the County of New York, and the parties hereby consent to the jurisdiction of such courts, waive any objection to venue, and waive any claim or defense that such courts are an inconvenient forum. \n\nEach party has had the opportunity to review this agreement with independent legal counsel and agrees to be bound by its terms and conditions. This agreement may not be amended or modified, except in writing signed by an authorized representative of each party. \n\nAny notice required or permitted under this agreement shall be in writing and shall be deemed given when delivered personally or sent by registered or certified mail, return receipt requested, or by nationally recognized overnight delivery service, postage prepaid, to the addresses set forth below or such other address as either party may provide in writing. \n\nThis Nda agreement shall be binding upon and inure to the benefit of the parties hereto and their respective successors and assigns. This agreement may not be assigned by either party without the prior written consent of the other party, except that either party may assign this agreement without the prior written consent of the other party in connection with a merger or sale of all or substantially all of its assets. \n\nThe parties agree to execute any additional documents and to take any additional actions that may be necessary to carry out the purposes of this agreement. This agreement constitutes the entire agreement between the parties and supersedes all prior agreements and understandings, whether written or oral, relating to the subject matter of this agreement. \n\nIN WITNESS WHEREOF, the parties hereto have duly executed this Nda agreement as of the date first above written. \n\nI. Counterparts\n\nThis agreement may be executed in counterparts, each of which shall be deemed an original, but all of which together shall constitute one and the same instrument. Counterparts may be delivered via electronic means, including facsimile or email, and shall be deemed valid and enforceable to the same extent as an original counterpart. This agreement may be executed and delivered by scanned PDF, DocuSign or any other electronic means, the authenticity and validity of which shall be determined under the laws of the state of New York. Each party's signature on a counterpart of this agreement shall be deemed an original signature and binding upon the party. \n\nJ. Survival: \n\nThis Agreement shall be binding upon and inure to the benefit of the Parties hereto and their respective heirs, successors, and assigns. The terms and provisions of this Agreement shall survive the termination, expiration, or cancellation of this Agreement to the extent necessary to give full effect to the rights, obligations, and undertakings of the Parties under this Agreement. \n\nAny breach of this Agreement by any Party hereto shall not affect the validity or enforceability of any other provision herein, and the Parties shall not be released from compliance with any provision of this Agreement on account of any breach by the other Party. \n\nThis Agreement and its provisions shall survive any change in the legal status or corporate structure of the Parties. Moreover, the Parties acknowledge that the breach of the terms of this Agreement may cause irreparable harm, and that the non-breaching Party shall have the right to seek injunctive relief or any other equitable remedy in the event of any such breach, in addition to any other rights, remedies, or damages to which they may be entitled under this Agreement or applicable law. \n\nThis Agreement shall inure to the benefit of and be binding upon the Parties hereto and their respective heirs, legal representatives, successors, and assigns. \n\nThis Agreement shall be governed by and construed in accordance with the laws of the State of New York, without regard to its conflict of laws provisions. Any action, suit, or proceeding arising from or relating to this Agreement shall be brought exclusively in a court of competent jurisdiction in New York, and each Party hereby submits to the jurisdiction of such courts for the purpose of any such action, suit, or proceeding. \n\nIN WITNESS WHEREOF, the Parties hereto have duly executed this Agreement as of the date first above written. \n\nSection K: No Third-Party Beneficiaries\n\nThis NDA contract between Party A and Party B governed by the law of New York does not create any rights or benefits for any third party. The parties involved in this agreement are the sole beneficiaries of the agreement, and no other person, company, or organization shall have any right to enforce any provision of this agreement. Therefore, no person other than Party A or Party B has the authority to make any claims or obtain any benefits under this NDA contract.\n\nFurthermore, the rights and obligations of the parties under this agreement may not be assigned or transferred to any third party without the prior written consent of the other party. Any such unauthorized transfer or assignment is null and void.\n\nIn the event that any provision of this agreement is found to be unenforceable, the remaining provisions shall continue in full force and effect. This clause shall survive the termination of this agreement.\n\nIn summary, the parties agree that no third party shall have any rights or benefits under this NDA contract between Party A and Party B governed by the law of New York. Both parties acknowledge and agree that this clause is a material term of the agreement and has been considered in bargaining and negotiating the terms and conditions contained herein."}