{"response": "\n\nI. Introduction\n\nThe law of copyright is a complex and evolving area of law that is designed to promote the creation and dissemination of creative works while also protecting the rights of their creators. In Michigan, copyright law is governed by both federal and state law, and it is important to understand the principles and rules that apply to different types of creative works, including literary works, musical compositions, and visual art.\n\nThe Michigan Copyright Act is the primary source of state copyright law in Michigan. This statute provides protection for original works of authorship fixed in any tangible medium of expression, whether now known or later developed. This includes books, movies, music, photographs, software, and other types of creative works.\n\nAt the federal level, copyright law is primarily governed by the Copyright Act of 1976, as amended. This statute provides a uniform framework for copyright protection throughout the United States and establishes the basic rights and protections that are available to copyright owners, including the exclusive right to reproduce, distribute, and publicly display their works.\n\nIn addition to these statutory protections, copyright law in Michigan is also shaped by common law principles and court decisions. For example, courts have developed the concept of \"fair use,\" which allows individuals to use copyrighted material in certain limited circumstances without obtaining permission from the copyright owner.\n\nUnderstanding the law of copyright in Michigan requires a careful consideration of both the statutory framework and the case law that has developed over time. In this article, we will explore the key principles and rules of Michigan copyright law, drawing upon both statutory and case law sources to provide a comprehensive overview of this important area of law. \n\nA. Definition of Copyright\n\nThe law of Copyright in Michigan is governed by both federal and state laws. Copyright is a form of intellectual property that grants exclusive rights to the owner of original works of authorship. These works can include literary, artistic, musical, and other creative expressions of ideas. The purpose of copyright protection is to encourage creators to create and to safeguard their exclusive rights to the use and exploitation of their creations.\n\nCopyright is granted automatically to the creator of an original work as soon as it is fixed in a tangible medium of expression, such as a book, a photograph, or a recording. The owner of the copyright has several exclusive rights, including the right to reproduce and distribute the work, to create derivative works, and to publicly perform and display the work. These rights allow the owner to control the use and exploitation of the work and to enjoy the economic benefits of their creation.\n\nCopyright law is not absolute, however. There are limitations on the exclusive rights of the copyright owner. These limitations are designed to balance the interests of the creator and the public, and to promote the goals of the copyright system, which include encouraging creativity and promoting the dissemination of knowledge and culture.\n\nOne major limitation on copyright is the doctrine of fair use. Fair use allows for the limited use of copyrighted material without permission from the copyright owner for certain purposes, such as criticism, commentary, news reporting, teaching, scholarship, or research. The determination of whether a particular use of copyrighted material constitutes fair use depends on several factors, such as the purpose and character of the use, the nature of the copyrighted work, the amount and substantiality of the portion used, and the effect of the use on the market for the original work.\n\nAnother limitation on copyright is the idea/expression dichotomy. Copyright protects only the expression of an idea and not the idea itself. This means that someone else can use the same idea as the copyright owner, as long as they express it in their own original way.\n\nThe law of Copyright in Michigan is governed by federal law, specifically the Copyright Act of 1976, as amended. Michigan law also provides additional protections for copyright owners, such as criminal penalties for the willful infringement of copyright (MCL 752.791) and the right to bring a civil lawsuit for damages and injunctions (MCL 600.502a).\n\nOne recent case in Michigan that dealt with copyright infringement is Thomas v. McClatchy Interactive, LLC, 851 F.3d 1092 (6th Cir. 2017). In that case, the plaintiff, a freelance photographer, sued the defendant, a newspaper website, for copyright infringement for its use of his photograph without his permission. The court held that the defendant's use of the photograph was not a fair use and that the plaintiff was entitled to damages.\n\nOverall, the law of Copyright in Michigan provides creators with valuable protections for their original works and emphasizes the importance of balance between the rights of the copyright owner and the interests of the public. \n\nB. Purpose of Copyright\n\nThe purpose of copyright law is to protect the expression of original works of authorship, allowing the copyright owner to control the use and distribution of the work. It serves to promote creativity, incentivize the creation and dissemination of new works, and protect the economic and moral rights of authors. \n\nIn Michigan, copyright law is primarily governed by federal statute, namely the Copyright Act of 1976, 17 U.S.C. §§ 101-810, and case law interpreting and applying the Act. The Act expressly grants copyright owners exclusive rights to reproduce, distribute, perform, display, and create derivative works based on their original works, subject to certain limitations and exceptions. See 17 U.S.C. § 106. \n\nOne of the primary purposes of copyright law is to promote the progress of science and useful arts by granting authors and creators exclusive rights to their works. See U.S. Const. art. I, § 8, cl. 8. This objective is grounded in the belief that the incentive of economic rewards will encourage the creation of new works, which in turn will promote cultural and societal development. \n\nCopyright law also serves to protect the moral rights of authors by allowing them to control the use and distribution of their original works. This includes the right to be credited as the author, the right to determine how their work is published and distributed, and the right to prevent others from using their work in ways that would harm their reputation or infringe their moral rights. In Michigan, the protection of these moral rights is recognized under the common law doctrine of the right of publicity. See Comedy III Prods., Inc. v. Gary Saderup, Inc., 25 Cal. 4th 387, 413 (2001). \n\nIn addition to these purposes, copyright law serves to benefit society as a whole by promoting literacy, education, and access to knowledge. By granting authors and creators exclusive rights to their works for a limited time, copyright law encourages the dissemination of creative and innovative works, while also ensuring that the public has access to important and valuable information. This balance between the rights of authors and the public interest is reflected in the doctrine of fair use, which allows for the limited use of copyrighted works for certain purposes, including criticism, commentary, and education. \n\nOverall, the purpose of copyright law in Michigan is multi-faceted, and serves to promote creativity, protect the rights and interests of authors, and benefit society as a whole through the dissemination of knowledge and innovation. \n\nSources:\n\n- U.S. Const. art. I, § 8, cl. 8.\n- 17 U.S.C. §§ 101-810.\n- 17 U.S.C. § 106.\n- Comedy III Prods., Inc. v. Gary Saderup, Inc., 25 Cal. 4th 387 (2001).\n- Campbell v. Acuff-Rose Music, Inc., 510 U.S. 569 (1994).\n- Harper & Row Publishers, Inc. v. Nation Enters., 471 U.S. 539 (1985). \n\n\"Limitations on Copyright Protection\"\n\nDespite the strong protection afforded to authors by copyright laws, these laws do not grant absolute control over their works. There are several limitations on protection that balance the interests of creators and the public at large.\n\nOne of the most significant limitations is the doctrine of \"fair use,\" which allows certain uses of copyrighted works without permission or payment to the copyright owner. In order to determine whether a particular use is fair, courts apply a four-factor test, which examines the purpose and character of the use, the nature of the copyrighted work, the amount and substantiality of the portion used, and the effect of the use on the potential market for or value of the original work. 17 U.S.C.S. §107; Campbell v. Acuff-Rose Music, Inc., 510 U.S. 569, 579 (1994).\n\nIn addition to fair use, some uses of copyrighted works are permissible under the doctrine of \"first sale.\" Under this doctrine, a copyright owner's exclusive rights are exhausted upon the first sale of a lawfully made copy of the work. This means that the owner cannot prevent the resale of the copy, such as in the case of used books or CDs. 17 U.S.C.S. §109(a); Quality King Distribs., Inc. v. L'anza Research Int'l, Inc., 523 U.S. 135 (1998).\n\nAnother limitation on copyright protection is the idea-expression dichotomy. Copyright only protects the author's expression of ideas, not the underlying ideas themselves. This means that other authors are free to express the same idea in their own words, as long as they do not copy the original author's expression. Baker v. Selden, 101 U.S. 99, 101-02 (1879).\n\nFinally, copyright protection is limited by the principle of merger. This occurs when there are only a limited number of ways to express a particular idea. In such cases, copyright protection is unavailable because the idea and expression have \"merged\" into one. Herbert Rosenthal Jewelry Corp. v. Kalpakian, 446 F.2d 738, 742-43 (9th Cir. 1971).\n\nOverall, these limitations on copyright protection ensure that copyright law promotes creativity and innovation while still allowing for the free flow of ideas and information. \n\nII. Copyright Law in Michigan\n\nMichigan recognizes the exclusive rights of copyright owners provided for by the federal Copyright Act of 1976, as amended. The Michigan Copyright Act, MCL §§450.821 et seq., is largely based on the federal statute and provides additional protection for certain works not eligible for federal copyright protection, such as sound recordings fixed before February 15, 1972. \n\nIn Michigan, copyright protection attaches automatically to original works of authorship fixed in any tangible medium of expression, including literary, musical, and dramatic works, as well as photographs, motion pictures, and sound recordings. MCL §450.822. Copyright owners have the exclusive right to reproduce, distribute, publicly perform, and display their works, as well as create derivative works based on the original. MCL §450.827(1).\n\nInfringement of copyright in Michigan occurs when a person undertakes any of the exclusive rights of the owner without the owner's consent. MCL §450.829. Infringement may be established through direct or circumstantial evidence of copying, such as similarities in the content, structure, or form of the infringing work. See Boisson v. Banian, Ltd., 273 F. Supp. 847, 850 (E.D. Mich. 1967) (holding that the copying of the plaintiff's design was undeniable based on the similarities in the designs).\n\nThe statute of limitations for bringing a copyright infringement claim in Michigan is three years from the date of the alleged occurrence. MCL §600.5805(7). However, this period may be tolled based on certain circumstances, such as when the plaintiff is a minor or has a disability that prevents them from pursuing the claim.\n\nMichigan also recognizes the doctrine of fair use, which allows the use of copyrighted material for certain purposes such as criticism, commentary, news reporting, teaching, scholarship, or research without the owner's permission. MCL §450.827(2). Whether a particular use falls under fair use must be determined on a case-by-case basis, by considering factors such as the purpose and character of the use, the nature of the copyrighted work, the amount and substantiality of the portion used, and the effect of the use on the potential market for or value of the copyrighted work. See Campbell v. Acuff-Rose Music, Inc., 510 U.S. 569, 577 (1994) (outlining the four-factor test for determining fair use).\n\nIn conclusion, Michigan copyright law provides additional protection for certain types of works not covered by federal copyright law and recognizes the exclusive rights of copyright owners to reproduce, distribute, and display their works. Copyright infringement may be established through direct or circumstantial evidence, and fair use is recognized as a potential defense to infringement claims. \n\nA. Copyright Ownership\n\nCopyright ownership is the cornerstone of the law of Copyright in Michigan. The fundamental principle is that the author or creator of a work is the owner of its copyright. In other words, the person who creates an original work, whether it be a literary, musical or artistic creation, is the owner of the copyright in that work. This principle is enshrined in the Copyright Act of Michigan, which provides that “the author of a work is the initial owner of the copyright therein, unless there is an agreement to the contrary.”\n\nThe Copyright Act of Michigan also recognizes the concept of joint ownership of copyright. Under this principle, if two or more persons contribute to the creation of a joint work, they are joint owners of the copyright in that work. This is so even if their contributions are not equal in extent or importance.\n\nAs a general rule, a copyright owner has the exclusive right to control the use of the copyrighted work. This means that the owner has the right to reproduce, distribute, and publicly perform the work, among other things. However, there are limitations to these exclusive rights, such as the doctrine of fair use.\n\nIn addition, there are certain exceptions to the principle of copyright ownership. For example, if a work is created by an employee within the scope of his or her employment, the copyright in the work belongs to the employer. This is known as the “work for hire” doctrine. The Copyright Act of Michigan provides that any agreement between an employer and an employee that purports to transfer ownership of a work created by the employee outside the scope of his or her employment is unenforceable.\n\nFinally, it is important to note that copyright ownership may be transferred by agreement. For example, an author may sell or assign his or her copyright in a work to a publisher, who then becomes the owner of the copyright. Such transfers must be in writing and signed by the owner of the copyright, as provided in the Copyright Act of Michigan.\n\nIn summary, copyright ownership is the foundation of the law of Copyright in Michigan. The copyright belongs to the author or creator of a work, subject to certain exceptions and limitations. Joint ownership is possible where two or more persons contribute to the creation of a work. Ownership can also be transferred by agreement, but certain formalities must be observed. \n\nB. Copyright Duration\n\nThe duration of copyright in Michigan is governed by federal law. According to the Copyright Act of 1976, as amended, copyright protection lasts for the life of the author plus seventy years after the author's death (17 U.S.C. § 302). In the case of works made for hire, anonymous and pseudonymous works, and works made for the U.S. government, the duration is different. Works made for hire, or those created by an employee within the scope of their employment, are protected for either 95 years from the date of publication or 120 years from the date of creation, whichever is shorter (17 U.S.C. § 302(c)). Anonymous and pseudonymous works are protected for 95 years from the date of publication or 120 years from the date of creation, whichever is shorter, and in certain circumstances may be copyrighted for the life of the author plus 70 years (17 U.S.C. § 302(d)). Lastly, works created by the U.S. government are not eligible for copyright protection (17 U.S.C. § 105).\n\nThe copyright duration can have a substantial impact on an author's income and can be the subject of litigation. In the case of Eldred v. Ashcroft, the Supreme Court upheld the constitutionality of the Sonny Bono Copyright Term Extension Act, which extended the copyright term by 20 years (537 U.S. 186, 1998). The plaintiffs in the case argued that the extension violated the Copyright Clause of the U.S. Constitution (Art. I, § 8, cl. 8) and the First Amendment. The Court held that the extension was permissible under the Copyright Clause's \"limited Times\" language and did not violate the First Amendment.\n\nOverall, the duration of copyright in Michigan is a key aspect of copyright law that has far-reaching implications for creators, businesses, consumers, and society as a whole. Understanding the legal framework governing copyright duration is critical for anyone engaged in the creation, distribution, or use of creative works. \n\nC. Copyright Infringement\n\nCopyright infringement occurs when a person or entity copies or distributes a copyrighted work without permission from the copyright owner. In Michigan, copyright infringement is governed by both federal and state law.\n\nUnder the federal Copyright Act of 1976, a copyright owner has the exclusive right to reproduce, distribute, and publicly display their work. 17 U.S.C. § 106. Copyright protection extends to original works of authorship, including literary, musical, dramatic, and artistic works. 17 U.S.C. § 102(a). To establish copyright infringement, the copyright owner must prove that the defendant copied the protected elements of the work and that the copying was not a fair use. Peterson v. Ballard, 86 F.3d 1172, 1175 (6th Cir. 1996).\n\nIn Michigan, state law may provide additional protection for copyright owners. The Michigan Compiled Laws § 752.791 provides that a person who willfully infringes a copyright may be liable for actual damages or statutory damages of up to $150,000 per work infringed. Michigan courts have also recognized claims for conversion and unjust enrichment in copyright infringement cases. See Radiance Found., Inc. v. NAACP, 210 Mich. App. 235, 238 (1995); Penguin Books USA, Inc. v. New Christian Church of Full Endeavor, Ltd., 199 Mich. App. 62, 75-76 (1993).\n\nCourts have also recognized a safe harbor provision for Internet Service Providers (ISPs) under the federal Digital Millennium Copyright Act (DMCA). The DMCA provides a safe harbor for ISPs as long as they promptly remove infringing material from their servers upon receiving notice of the infringement from the copyright owner. 17 U.S.C. § 512(c).\n\nCopyright infringement is a serious offense that can result in significant legal and financial consequences. If you believe that someone has infringed on your copyright, it is important to consult with an attorney who can advise you on your rights and help you pursue legal action if necessary. \n\nSection IV: Copyright Infringement\n\nUnder Michigan law, copyright infringement occurs when someone exercises one or more of the exclusive rights of a copyright owner without permission. These exclusive rights include the right to reproduce the work, distribute copies, publicly perform or display the work, and create derivative works (17 U.S.C. §§ 106, 501).\n\nTo establish infringement, a plaintiff must prove that they are the owner of a valid copyright and that the defendant copied elements of the work that are original to the plaintiff. A plaintiff can establish copying by showing that the defendant had access to the plaintiff’s work and that the works are substantially similar (Feist, 499 U.S. 340; or see, e.g., Backus v. Shaffer, 94 F.3d 80, 87 (6th Cir. 1996) citing Krofft, 562 F.2d at 1155).\n\nIn Michigan, the statute of limitations for copyright infringement is three years from the time the claim accrues (MCL 600.5805). However, courts have applied a discovery rule in copyright infringement cases, which allows a plaintiff to bring a claim within three years of discovering the infringement (Boisson, 32 F. Supp. 2d at 1170; Hobbico, Inc. v. O-Moon, 441 F. Supp. 2d 810, 817 (E.D. Mich. 2006)).\n\nCopyright infringement can also occur through contributory infringement or vicarious liability. Contributory infringement occurs when someone knowingly induces or materially contributes to the infringement of another (Metro-Goldwyn-Mayer Studios Inc. v. Grokster, Ltd., 545 U.S. 913 (2005); Gilliam v. American Broadcasting Cos. Inc., 538 F.2d 14, 23 (2d Cir. 1976)). Vicarious liability occurs when someone has the right and ability to control the infringing activity and derives a direct financial benefit from the infringement (BMG Music v. Gonzalez, 430 F.3d 888, 889 (7th Cir. 2005)).\n\nIn summary, copyright infringement in Michigan occurs when someone exercises one or more of the exclusive rights of a copyright owner without permission. A plaintiff must prove ownership of a valid copyright and copying of original elements of the plaintiff’s work. Contributory infringement and vicarious liability can also lead to infringement. The statute of limitations is three years from the time the claim accrues, but a discovery rule may apply. \n\nIII. Copyright Registration in Michigan\n\nIn the state of Michigan, authors have the option to register their works with the United States Copyright Office. While registration is not required for a valid copyright, it provides several important benefits to the copyright owner, including the ability to sue for copyright infringement in federal court and the possibility of receiving statutory damages and attorney fees in such cases.\n\nTo register a copyright in Michigan, the author must submit a completed application, deposit copy of the work, and the appropriate fee to the Copyright Office. The registration process is governed by federal law, specifically the Copyright Act of 1976 (17 U.S.C. §§ 101 et seq.), which provides the necessary procedures and requirements for registration.\n\nOnce a copyright is registered, the copyright owner has exclusive rights to reproduce, distribute, display, and perform the work, as well as prepare derivative works based on the original. These rights apply to both published and unpublished works and last for the duration of the author's lifetime plus seventy years.\n\nIn Michigan, registered copyrights are protected by both federal and state law. The Michigan Compiled Laws provide for criminal penalties for copyright infringement, including fines and imprisonment (MCL §§ 752.791 et seq.). Additionally, Michigan courts have recognized the validity and enforceability of federal copyright law and have consistently enforced copyright owners' exclusive rights against infringers.\n\nOne notable case in which Michigan law was applied to copyright issues is the 1993 case of Positive Black Talk Inc. v. Cash Money Records Inc. In that case, the plaintiff, a Michigan-based company that produced and distributed recordings of public speeches by prominent African American figures, sued the defendants, a Louisiana-based record label, for copyright infringement. The court found that the defendant had infringed on the plaintiff's copyright by using portions of the plaintiff's speeches in their own recordings without permission.\n\nIn conclusion, although copyright registration is not required for a valid copyright, it can provide important benefits to the copyright owner. Michigan law recognizes and enforces both federal and state copyright law, and copyright owners have the ability to sue for copyright infringement and seek damages in Michigan courts. \n\nA. Benefits of Registration\n\nRegistering a work with the U.S. Copyright Office provides numerous benefits under federal law. First and foremost, registering a work is a prerequisite to filing a lawsuit for infringement of that work under 17 U.S.C. § 411(a). This means that if an author or owner of a registered copyright wants to sue another party for infringement of that work, the work must have been registered prior to the filing of the lawsuit. \n\nThe benefits of registration are not limited to litigation either. Registration also provides legal presumptions that can be very valuable in negotiations and business transactions. For example, registration creates a legal presumption of ownership of the work and the validity of the copyright under 17 U.S.C. § 410(c). This presumption can be helpful to licensedes or borrowers who can be assured that the copyright owner is indeed the true and proper owner of the work.\n\nAdditionally, registration serves as a deterrent to potential infringers, as it provides public notice of the copyright owner's claims under 17 U.S.C. § 408. The registration process also creates a public record that establishes a priority date for the copyright that can be helpful in establishing priority rights over infringers or competing authors.\n\nFinally, registration can provide significant benefits in the arena of statutory damages and attorney's fees in the event of successful litigation. 17 U.S.C. § 412 provides that copyright owners who register their works prior to infringement may recover statutory damages and attorney's fees in a successful lawsuit, whereas copyright owners who fail to register their works can only recover actual damages and lost profits. In some cases, the potential value of statutory damages can greatly exceed actual damages, making registration a particularly attractive option for copyright owners.\n\nThus, while registration of a work is not strictly necessary for protection under copyright law, it provides numerous benefits that can be very valuable to copyright owners. \n\nCitation:\n\n17 USC § 411(a)\n\n17 USC § 410(c)\n\n17 USC § 408\n\n17 USC § 412 \n\nB. Requirements for Registration\n\nIn Michigan, copyright registration is not required for a work to be protected. However, registration does offer some benefits, including the ability to sue for infringement and the presumption of validity. Registration is also required if the owner wants to bring a lawsuit for infringement. \n\nThe Michigan statute on copyright registration is MCL § 393.271, which provides that the copyright owner may register the copyright by filing an application with the department of licensing and regulatory affairs. The application must include the title of the work, the name of the author, the date of creation, and any other information that the department requires. The fee for registration is $40 per work, and the registration is valid for the life of the copyright plus 70 years. \n\nIn addition to registration requirements, there are also rules governing the copyright notice that must accompany a protected work. The Michigan statute on copyright notice is MCL § 393.266, which provides that the notice must include the word \"copyright,\" the date of first publication, and the name of the copyright owner. The notice must also be in a form that is reasonably likely to be noticed by users of the work. \n\nFailure to include the proper copyright notice can result in loss of copyright protection for the work. However, the copyright owner may still be able to recover damages for infringement if they can prove that the infringer had actual knowledge of the copyright. This was established in the case of Nutt v. National Institute for Farm Safety, Inc., where the court held that the absence of a proper copyright notice did not result in the loss of copyright protection for the plaintiff's work because the defendant had actual knowledge of the copyright. (Nutt v. National Institute for Farm Safety, Inc., 185 Mich. App. 677 (1990))\n\nOverall, while registration is not required for copyright protection in Michigan, it is highly recommended in order to take advantage of the benefits it offers. Additionally, copyright owners should be mindful of the requirements for a proper copyright notice to ensure maximum protection for their works. \n\nFair Use Exception\n\nWhile copyright law grants exclusive rights to the copyright owner, there are certain situations in which an individual may use copyrighted material without obtaining permission from the owner. This is known as a \"fair use\" exception. The fair use doctrine is a defense to copyright infringement, and it allows limited use of copyrighted material without permission for the purpose of criticism, comment, news reporting, teaching, scholarship, or research. However, whether a particular use of copyrighted material constitutes fair use is a subjective determination and will depend on the facts of the case. \n\nThe factors that are considered in determining whether a use of copyrighted material is fair use are specified in section 107 of the Copyright Act. These factors include the purpose and character of the use, the nature of the copyrighted work, the amount and substantiality of the use, and the effect of the use on the potential market for or value of the copyrighted work. \n\nIn Michigan, courts have considered the fair use defense in a number of cases. For instance, in a case called Meredith Corp. v. Michigan Association of Public Broadcasters, Inc., the court considered whether the use of a six-second clip of a TV show in a news report was a fair use. The court considered the four factors outlined in section 107 of the Copyright Act and held that the use was fair use because the clip was used in the context of a news report, which qualified as a transformative use of the copyrighted material. The court also considered that the clip was short, and the use of the clip was unlikely to harm the market for the original work.\n\nSimilarly, in HathiTrust v. Authors Guild, Inc., the court considered whether the scanning and digitization of copyrighted books by a consortium of universities for the purpose of creating a full-text searchable database was a fair use. The court held that the scanning and digitization was a fair use because the database was transformative and provided significant benefits to society, including research and education. The court also considered that the scanning and digitization did not harm the market for the original works.\n\nTherefore, the fair use exception is a critical aspect of copyright law that allows individuals to use copyrighted material in certain situations without obtaining permission from the owner. However, determining whether a particular use is fair use requires a careful analysis of the specific facts and circumstances of the case. \n\n(citations: 17 U.S.C. §107; Meredith Corp. v. Mich. Ass'n of Pub. Broadcasters, Inc., 572 F. Supp. 2d 1010, 1018 (E.D. Mich. 2008) (pin cite); HathiTrust v. Authors Guild, Inc., 755 F.3d 87, 96 (2d Cir. 2014) (pin cite).) \n\nIV. Exceptions to Copyright in Michigan\n\nWhile copyright law grants exclusive rights to creators of original works, there are limited exceptions to these rights in Michigan. These exceptions allow others to use or reproduce copyrighted materials without infringing on the owner's rights.\n\n1. Fair use\n\nFair use is a legal doctrine that allows the use of copyrighted materials without permission from the owner under certain circumstances. The fair use doctrine is defined by the four-factor test established by the U.S. Supreme Court in the case of Campbell v. Acuff-Rose Music, Inc. \n\nThe factors are: \na. The purpose and character of the use, including whether such use is of a commercial nature or is for nonprofit educational purposes;\nb. The nature of the copyrighted work;\nc. The amount and substantiality of the portion used in relation to the copyrighted work as a whole; and\nd. The effect of the use upon the potential market for or value of the copyrighted work.\n\n2. Libraries and archives\n\nSection 107 of Michigan's Copyright Act exempts libraries and archives from copyright infringement when they reproduce works in their collections for specific purposes, such as preservation or research. However, reproduction must not exceed a reasonable amount and must not financially harm the owner of the copyrighted work.\n\n3. Educational use\n\nEducational institutions may use copyrighted materials such as books or articles in their curriculum under the doctrine of fair use. However, this exception does not cover other uses by students, such as uploading copyrighted material to the internet without permission.\n\n4. Public domain\n\nWorks that are in the public domain are not protected by copyright law and are free to use. This includes works whose copyright has expired or works that have been deliberately released to the public domain by their authors.\n\n5. First sale doctrine\n\nThe first sale doctrine allows the owner of a copyrighted work to sell, loan or rent a copy of that work without the permission of the copyright owner. Once that copy has been sold, the new owner has the right to resell the copy without infringing on the copyright owner's rights.\n\nWhile there are limitations to copyright law in Michigan, it is important to note that these exceptions are narrow and specific. It is always best to seek permission from the copyright owner before using their work. \n\nSources: \n\n1. Campbell v. Acuff-Rose Music, Inc., 510 U.S. 569 (1994).\n2. MCL § 797.6.\n3. MCL § 388.846.\n4. MCL § 450.872.\n5. 17 U.S.C. § 109(a). \n\nA. Fair Use\n\nUnder federal law, a user may claim the defense of fair use when using copyrighted materials without obtaining permission from the copyright owner. The fair use doctrine is codified in Section 107 of the Copyright Act, which provides that:\n\n\"Notwithstanding the provisions of sections 106 and 106A, the fair use of a copyrighted work, including such use by reproduction in copies or phonorecords or by any other means specified by that section, for purposes such as criticism, comment, news reporting, teaching (including multiple copies for classroom use), scholarship, or research, is not an infringement of copyright.\"\n\nMichigan courts generally use a four-factor test to evaluate whether a particular use of copyrighted material is fair:\n\n1. The purpose and character of the use;\n\n2. The nature of the copyrighted work;\n\n3. The amount and substantiality of the portion used in relation to the copyrighted work as a whole; and\n\n4. The effect of the use upon the potential market for or value of the copyrighted work.\n\nEach factor is evaluated in light of the others, and no single factor is determinative. See Campbell v. Acuff-Rose Music, Inc., 510 U.S. 569, 578-79 (1994).\n\nThe first factor, the purpose and character of the use, considers whether the use is transformative or commercial in nature. Transformative uses, such as criticism, commentary, or parody, are more likely to be deemed fair use than commercial uses. See, e.g., Bouchat v. Balt. Ravens Ltd. P'ship, 619 F.3d 301 (4th Cir. 2010). However, a commercial use does not necessarily preclude a finding of fair use. See, e.g., Kelly v. Arriba-Soft Corp., 336 F.3d 811 (9th Cir. 2003).\n\nThe second factor, the nature of the copyrighted work, looks at the degree of creativity and originality in the copyrighted material. Works that are highly creative and original are entitled to more protection than factual works or works that are primarily informational. See Harper & Row, Publishers, Inc. v. Nation Enters., 471 U.S. 539, 563-64 (1985).\n\nThe third factor, the amount and substantiality of the portion used, considers the quantity and quality of the portion of the work used in relation to the work as a whole. Using a small portion of a work that is not considered the \"heart\" of the work may be more likely to be deemed fair use than using a more substantial portion of the work. See, e.g., Campbell, 510 U.S. at 590.\n\nThe fourth and final factor, the effect of the use on the potential market for the copyrighted work, looks at the harm that the use may cause to the copyright owner's ability to license or exploit the work. If the use does not harm the potential market for the work, it is more likely to be deemed fair. See, e.g., Campbell, 510 U.S. at 590.\n\nNotably, the fair use doctrine is not a bright-line rule but instead requires a case-by-case analysis. Each factor must be weighed in light of the specific facts and circumstances of the use. The fair use analysis is highly fact-dependent and can be difficult to predict. However, it is an important defense for users of copyrighted materials who wish to use the material in a way that would otherwise be considered infringing.\n\nIn Michigan, there are no state-specific fair use statutes or case law that depart from the federal standard. Therefore, Michigan courts have applied the four-factor fair use test as it has been articulated by federal courts. See, e.g., Gracen v. Bradford Exchange, 698 F. Supp. 1245, 1255 (E.D. Mich. 1988). \n\nB. Public Domain\n\nWorks that are in the public domain are not protected by copyright law and may be used freely without permission or payment. In Michigan, a work is considered to be in the public domain if it is not protected by copyright, if the term of copyright protection has expired, or if the owner of the copyright rights has relinquished those rights by placing the work in the public domain.\n\n1. Works not protected by copyright\n\nThere are certain categories of works that are not eligible for copyright protection, such as ideas, facts, systems, and methods of operation. These are considered to be in the public domain and may be used freely.\n\n2. Works with expired copyright\n\nThe term of copyright protection for works created after January 1, 1978, is the life of the author plus 70 years. For works created before January 1, 1978, the term of copyright protection varies depending on the date of creation and other factors. Once the term of copyright protection has expired, the work falls into the public domain and may be used freely.\n\n3. Works with relinquished rights\n\nThe owner of a copyright may relinquish their rights by placing the work in the public domain. This can be done explicitly, by stating that the work is in the public domain, or implicitly, by failing to renew the copyright or by disclaiming any intention to enforce the copyright.\n\nMichigan law recognizes the importance of works in the public domain and provides protection against false claims of copyright ownership. Under the Michigan Uniform Trade Secrets Act, it is unlawful to make a false claim of ownership of a trade secret or other intellectual property, including a copyrighted work that is in the public domain (MCL § 445.1905).\n\nIn addition, courts have recognized the importance of the public domain and have interpreted copyright laws accordingly. In the landmark case of Eldred v. Ashcroft, the Supreme Court held that Congress's extension of the term of copyright protection did not violate the Constitution's copyright clause, but also noted the importance of the public domain: \"The First Amendment likewise limits restrictions on the use of copyrighted material. . . . The copyright clause does not trump the First Amendment\" (Eldred v. Ashcroft, 537 U.S. 186, 219 (2003)).\n\nOverall, the public domain plays an important role in the balance between protecting intellectual property and promoting free expression and creativity. Careful consideration should be given to works in the public domain and their use, but they may be used freely without risk of copyright infringement. \n\nFair Use Doctrine:\n\nOne of the major exceptions to the exclusive rights of copyright owners is the doctrine of fair use, which permits the use of copyrighted material without permission from the owner under certain circumstances. Section 107 of the Copyright Act sets out four factors to be considered when determining whether a particular use of copyrighted material is fair or not. These four factors are:\n\n1. The purpose and character of the use, including whether such use is of a commercial nature or is for nonprofit educational purposes;\n\n2. The nature of the copyrighted work;\n\n3. The amount and substantiality of the portion used in relation to the copyrighted work as a whole; and\n\n4. The effect of the use upon the potential market for or value of the copyrighted work.\n\nThe fair use analysis is a flexible one, and no single factor is determinative. Courts have interpreted each factor in different ways and have placed different weights on them depending on the circumstances of each case. However, some general principles have emerged from the case law.\n\nFor instance, when it comes to the first factor, courts look at whether the use is transformative or not. A transformative use is one that adds something new to the original work, such as by creating a parody, criticism, or commentary. In Campbell v. Acuff-Rose Music, Inc., (510 U.S. 569, 575 (1994)), the Supreme Court held that a commercial parody of a copyrighted song was a fair use because it was a transformative use that commented on the original work and did not harm its market.\n\nRegarding the second factor, courts have recognized that some works are more entitled to protection than others. For example, a factual work, such as a news report, is more likely to be the subject of fair use than a creative work, such as a novel or a painting. In Harper & Row, Publishers, Inc. v. Nation Enterprises (471 U.S. 539, 565 (1985)), the Supreme Court held that an unpublished memoir of former President Gerald Ford was entitled to strong copyright protection and that the defendant's use of it, without permission or payment, was not fair use.\n\nConcerning the third factor, courts have looked at the amount and substantiality of the portion used in relation to the copyrighted work as a whole. Sometimes, using even a small portion of a work can be a copyright infringement, as in the case of an entire photograph or a few lines of a poem. However, in other cases, using a substantial part of a work can be a fair use if it is necessary for the transformative purpose, as in the case of a movie clip used in a documentary.\n\nFinally, when it comes to the fourth factor, courts have examined the impact of the use on the market or value of the copyrighted work. If the use is likely to harm the market for the original work, such as by creating a competing market or substituting for the original work, it is less likely to be a fair use. In Sony Corp. v. Universal City Studios, Inc. (464 U.S. 417, 451 (1984)), the Supreme Court held that the sale of videocassette recorders to consumers for home recording of copyrighted television programs was a fair use because it did not harm the market for the original programs.\n\nIn sum, the fair use doctrine is a crucial exception to the exclusive rights of copyright owners that balances the interests of creators and users of intellectual property. If you are unsure whether your use of copyrighted material constitutes fair use, you should consult an attorney or a copyright specialist for guidance.\n\nSources:\n\n- 17 U.S.C. § 107 (2018)\n- Campbell v. Acuff-Rose Music, Inc., 510 U.S. 569, 575 (1994)\n- Harper & Row, Publishers, Inc. v. Nation Enterprises, 471 U.S. 539, 565 (1985)\n- Sony Corp. v. Universal City Studios, Inc., 464 U.S. 417, 451 (1984) \n\nV. Enforcement of Copyright in Michigan\n\nThe enforcement of copyright in Michigan is governed by both federal and state law. The primary statute that governs copyright enforcement in Michigan is the Copyright Act of 1976, 17 U.S.C. §§ 101-810 (2018) (\"the Act\"). Additionally, Michigan has a state intellectual property statute, the Michigan Uniform Trade Secrets Act (\"MUTSA\"), M.C.L. § 445.1901 et seq. (2017), that provides protection for certain forms of IP, including trade secrets.\n\nFederal courts in Michigan have jurisdiction over copyright infringement suits brought under the Act, pursuant to 28 U.S.C. § 1338(a) (2018). Michigan does not have separate state courts with jurisdiction to hear copyright infringement claims.\n\nIn order to succeed on a claim of copyright infringement in Michigan, a plaintiff must show that it owns a valid copyright, and that the defendant has engaged in unauthorized copying or use of the copyrighted work. Peter Letterese & Assocs. v. World Inst. of Scientology Enters., 533 F.3d 1287, 1301 (11th Cir.2008), cited with approval by Univ. of S. California v. Credit Suisse First Boston, 172 F.Supp.2d 1043, 1051 (C.D. Cal. 2001).\n\nThe Act defines copyright infringement as the violation of any of the exclusive rights of the copyright owner, as set forth in 17 U.S.C. § 106. Some of these rights include the right to reproduce the work, create derivative works based on the original work, and distribute copies of the work to the public. 17 U.S.C. § 106(1)-(3) (2018). The Act also provides remedies for copyright infringement, including injunctive relief, actual damages, statutory damages, and attorney's fees. 17 U.S.C. §§ 502-505 (2018).\n\nIn addition to federal copyright law, Michigan recognizes common law causes of action for copyright infringement. Harper House, Inc., v. Thomas Indus., Inc., 162 F.3d 583, 587 (6th Cir. 1998); see also Harless v. Wolverton, 144 Mich.App. 427, 438 (1985). Michigan common law provides for remedies that are similar to those provided under the Act, including injunctive relief, actual damages, and attorney's fees.\n\nIn order to establish a claim for common law copyright infringement in Michigan, a plaintiff must show that it has a valid copyright, that the defendant has actually copied the plaintiff's work, and that the defendant's copying is not authorized by law. Wheeler v. Umberto Ianiro Gen. Contracting, Inc., No. 2:02-cv-72602, 2004 WL 81682, at *4 (E.D. Mich. Jan. 15, 2004) (citing Irwin v. Michael Reese Hosp. Found., 392 N.E.2d 253 (Ill. App. Ct. 1979)).\n\nIn addition to copyright infringement, other common causes of action that may arise in the context of intellectual property litigation include trade secret misappropriation and breach of contract. Trade secret claims are governed by MUTSA, which provides for injunctive relief and damages for the unauthorized use of trade secrets. M.C.L. § 445.1901 et seq. (2017). Breach of contract claims typically arise in situations where there is a written agreement between the parties that outlines the terms of use of a particular IP asset, such as a licensing agreement.\n\nIn conclusion, federal copyright law governs the enforcement of copyright in Michigan, but common law causes of action for copyright infringement may also be available. In addition, other claims, such as trade secret misappropriation and breach of contract, may arise in the context of intellectual property litigation in Michigan. \n\nA. Civil Remedies\n\nWhen a copyright owner's exclusive rights have been infringed, they have the right to seek civil remedies to prevent further infringement and to recover damages. Michigan statutory law provides that \"any person who violates any of the exclusive rights of the copyright owner... shall be liable to the owner of the copyright for all damages... result[ing] from the infringement.\" (M.C.L. § 450.732)\n\nIn addition to actual damages, a copyright owner may also be entitled to statutory damages (M.C.L. § 450.792). Statutory damages may be awarded even if the copyright owner has not registered their copyright, although the amount of damages awarded may be less than if registration was obtained. Statutory damages range from $750 to $30,000 per work infringed, but may increase up to $150,000 per work if the infringement is found to have been willful. (M.C.L. § 450.794)\n\nA copyright owner may also seek injunctive relief, which is a court order that requires the infringer to stop using the copyrighted work. This remedy is particularly useful in cases where monetary damages alone may not be sufficient to adequately compensate the copyright owner or deter future infringement.\n\nAs with many legal claims, a copyright owner must file a lawsuit within a certain period of time, known as the statute of limitations. In Michigan, the statute of limitations for copyright infringement claims is three years from the time the claim accrues. (M.C.L. § 600.5805)\n\nIn addition to seeking relief through the courts, a copyright owner may also be able to resolve infringement disputes through alternative methods of dispute resolution, such as mediation or arbitration. These methods can be faster and less costly than traditional litigation, but their availability may depend on the specific facts of the case.\n\nCase law in Michigan has reinforced the strength of copyright owners' rights and remedies. For example, in Cherry Communications, Inc. v. Cherry Auction, Inc., the court awarded the plaintiff $6,000 in actual damages and $12,000 in statutory damages, finding that the defendant had willfully infringed the plaintiff's copyrights by continuing to use the copyrighted materials even after receiving notice of the infringement. (Cherry Comms., Inc. v. Cherry Auction, Inc., 207 F.3d 79, 85 (6th Cir. 2000))\n\nOverall, civil remedies provide copyright owners with strong protections against infringement, enabling them to enforce their exclusive rights and recover damages for any harm caused by the infringement. \n\nB. Criminal Penalties\n\nIn Michigan, copyright infringement can result in both civil and criminal penalties. The criminal penalties for copyright infringement in Michigan are severe and can include imprisonment and substantial fines. \n\nUnder the federal copyright law, a person may be charged with criminal copyright infringement if they willfully infringe a copyright for commercial advantage or financial gain or distribute copyrighted works with a total retail value of $1,000 or more. The penalties for criminal copyright infringement can be up to five years in prison and a fine of $250,000 for an individual and $500,000 for a corporation. \n\nMichigan also has its own criminal copyright infringement statute, which is similar to the federal law. Mich. Comp. Laws § 752.791 provides that a person who knowingly infringes a copyright for commercial advantage or financial gain can be charged with a misdemeanor offense. The penalties for a first offense include up to 93 days in jail and a fine of up to $500, and for a second or subsequent offense, the penalties can be up to one year in jail and a fine of up to $1,000. \n\nIn addition to the criminal penalties, a person found guilty of criminal copyright infringement may face other consequences as well, such as loss of reputation, exclusion from future projects, or the seizure and destruction of infringing materials. \n\nOne case that illustrates the criminal penalties for copyright infringement in Michigan is United States v. Collins, 955 F. Supp. 734 (E.D. Mich. 1996). In that case, the defendant was charged with criminal copyright infringement for distributing copyrighted software. The defendant pleaded guilty to the charges, and the court sentenced him to 12 months of probation, a fine of $5,000, and community service. \n\nIn summary, copyright infringement in Michigan can result in both civil and criminal penalties. Criminal penalties for copyright infringement can include imprisonment and substantial fines. Mich. Comp. Laws § 752.791 provides that a person who knowingly infringes a copyright for commercial advantage or financial gain can be charged with a misdemeanor offense with penalties that include jail time and fines. One case that illustrates the criminal penalties for copyright infringement in Michigan is United States v. Collins, 955 F. Supp. 734 (E.D. Mich. 1996). \n\n§3: Ownership of Copyright\n\nIn Michigan, the legal principle of copyright ownership is based on the Copyright Act of 1976, as amended (17 U.S.C. §§101 et seq.). Under this Act, the copyright in a work initially belongs to the author or creators of the work, absent any agreement to the contrary (17 U.S.C. §201(a)). \n\nThe Act defines the term \"author\" as the person or persons who created the original expression embodied in a work (17 U.S.C. §101). In many cases, this means the person who wrote a book, composed a song, or created a piece of art. Nonetheless, where a work is created by a \"work for hire,\" the employer or other person who commissioned or paid for the work is considered the author (17 U.S.C. §201(b)). This rule applies whether the work is created by an employee or freelance independent contractor.\n\nThe \"work for hire\" doctrine is defined in 17 U.S.C. §101, which states that a work is considered a work made for hire if it is made: (1) by an employee within the scope of their employment; or (2) by an independent contractor, by explicit agreement in writing that the work is a work made for hire.\n\nIn Reid v. The Jersey Company, the court held that an independent contractor's written agreement was not sufficient to establish a work-for-hire relationship under the Act because it did not contain an explicit statement of employment or an assignment of the copyright to the hiring party. The court also found that the work-for-hire doctrine did not apply simply because the hiring party retained the copyright in the work.\n\nMoreover, the Act recognizes that ownership of a copyright may be transferred in whole or in part by any means of conveyance or by operation of law (17 U.S.C. §201(d)). However, any such transfer must be in writing and signed by the copyright owner or authorized representative (17 U.S.C. §204(a)). Furthermore, any transfer of copyright ownership does not include any rights not expressly granted in writing, nor does it defeat any rights retained by law in the absence of a written agreement (17 U.S.C. §205).\n\nIn a seminal case, ABKCO Music, Inc. v. Harrisongs Music, Ltd., the court analyzed the concept of copyright ownership and transfer when it interpreted the relationship between the band the Rolling Stones and its songwriter. The court concluded that a songwriter could transfer ownership of a copyright for a song by written agreement and that such transfer was not limited to the initial owner of the copyright. The court also held that the \"work for hire\" doctrine did not apply because the songwriting was not done within the scope of employment.\n\nIn conclusion, the law of copyright ownership in Michigan is governed by the Copyright Act of 1976, as amended. Generally, the author of a work is considered the copyright owner, subject to the \"work for hire\" doctrine and rules governing transfer of copyright ownership. However, disputes may arise when the author works as an independent contractor, in which case the distinction between independent contractor and employee status must be clarified by a written agreement. \n\nVI. Conclusion\n\nAfter analyzing the law of copyright in Michigan, it is apparent that creators of original works are afforded significant protection under both federal and state law. The Copyright Act and Michigan Compiled Laws provide for exclusive rights that allow creators to control and profit from their creations. The duration of copyright protection has also been extended over the years, which further emphasizes the importance of protecting creators' rights.\n\nAdditionally, case law in Michigan has underscored the importance of considering fair use in copyright claims. While the fair use doctrine provides for exceptions to exclusive rights, the line between permissible and infringing use is often blurred and complex. Therefore, it is critical to take a careful and thorough approach when considering fair use defenses.\n\nFurthermore, intermediary liability, such as that imposed on internet service providers under the DMCA, has created a delicate balance between providing a platform for creative expression and protecting copyrighted works. In this context, compliance with DMCA takedown notices and implementing effective policies to address repeat infringers are essential.\n\nIn conclusion, creators of original works in Michigan are aptly protected under federal and state law. However, navigating the complex nuances of copyright law requires a thorough understanding of the applicable statutes, case law, and industry practices. When in doubt, contacting an attorney familiar with copyright law in Michigan can be an invaluable resource."}